app/controllers/actions_controller.rb

SELECT "actions".* FROM "actions"
---
    def index
        action = Action.all

INSERT INTO "actions" ("name", "description", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "BCBA"], ["description", "Get a BCBA you trust"], ["category_id", 3], ["created_at", "2021-08-10 03:02:37.629855"], ["updated_at", "2021-08-10 03:02:37.629855"]]
---
    def create
        action = Action.new(action_params)
        if action.save

SELECT "actions".* FROM "actions" WHERE "actions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "actions" SET "description" = ?, "updated_at" = ? WHERE "actions"."id" = ?  [["description", "schedule consistent session"], ["updated_at", "2021-08-10 03:56:11.694587"], ["id", 4]]
---
    def update
        action = Action.find(params[:id])
        if action.update(action_params)